espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/gpio_ext_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** GPIOSD_SIGMADELTA0_REG register
 *  Duty Cycle Configure Register of SDM0
 */
#define GPIO_EXT_SIGMADELTA0_REG (DR_REG_GPIOSD_BASE + 0x0)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD0_IN    0x000000FFU
#define GPIO_EXT_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIO_EXT_SD0_IN_V  0x000000FFU
#define GPIO_EXT_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD0_PRESCALE    0x000000FFU
#define GPIO_EXT_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIO_EXT_SD0_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA1_REG register
 *  Duty Cycle Configure Register of SDM1
 */
#define GPIO_EXT_SIGMADELTA1_REG (DR_REG_GPIOSD_BASE + 0x4)
/** GPIOSD_SD1_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD1_IN    0x000000FFU
#define GPIO_EXT_SD1_IN_M  (GPIOSD_SD1_IN_V << GPIOSD_SD1_IN_S)
#define GPIO_EXT_SD1_IN_V  0x000000FFU
#define GPIO_EXT_SD1_IN_S  0
/** GPIOSD_SD1_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD1_PRESCALE    0x000000FFU
#define GPIO_EXT_SD1_PRESCALE_M  (GPIOSD_SD1_PRESCALE_V << GPIOSD_SD1_PRESCALE_S)
#define GPIO_EXT_SD1_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD1_PRESCALE_S  8

/** GPIOSD_SIGMADELTA2_REG register
 *  Duty Cycle Configure Register of SDM2
 */
#define GPIO_EXT_SIGMADELTA2_REG (DR_REG_GPIOSD_BASE + 0x8)
/** GPIOSD_SD2_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD2_IN    0x000000FFU
#define GPIO_EXT_SD2_IN_M  (GPIOSD_SD2_IN_V << GPIOSD_SD2_IN_S)
#define GPIO_EXT_SD2_IN_V  0x000000FFU
#define GPIO_EXT_SD2_IN_S  0
/** GPIOSD_SD2_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD2_PRESCALE    0x000000FFU
#define GPIO_EXT_SD2_PRESCALE_M  (GPIOSD_SD2_PRESCALE_V << GPIOSD_SD2_PRESCALE_S)
#define GPIO_EXT_SD2_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD2_PRESCALE_S  8

/** GPIOSD_SIGMADELTA3_REG register
 *  Duty Cycle Configure Register of SDM3
 */
#define GPIO_EXT_SIGMADELTA3_REG (DR_REG_GPIOSD_BASE + 0xc)
/** GPIOSD_SD3_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD3_IN    0x000000FFU
#define GPIO_EXT_SD3_IN_M  (GPIOSD_SD3_IN_V << GPIOSD_SD3_IN_S)
#define GPIO_EXT_SD3_IN_V  0x000000FFU
#define GPIO_EXT_SD3_IN_S  0
/** GPIOSD_SD3_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD3_PRESCALE    0x000000FFU
#define GPIO_EXT_SD3_PRESCALE_M  (GPIOSD_SD3_PRESCALE_V << GPIOSD_SD3_PRESCALE_S)
#define GPIO_EXT_SD3_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD3_PRESCALE_S  8

/** GPIOSD_SIGMADELTA4_REG register
 *  Duty Cycle Configure Register of SDM4
 */
#define GPIO_EXT_SIGMADELTA4_REG (DR_REG_GPIOSD_BASE + 0x10)
/** GPIOSD_SD4_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD4_IN    0x000000FFU
#define GPIO_EXT_SD4_IN_M  (GPIOSD_SD4_IN_V << GPIOSD_SD4_IN_S)
#define GPIO_EXT_SD4_IN_V  0x000000FFU
#define GPIO_EXT_SD4_IN_S  0
/** GPIOSD_SD4_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD4_PRESCALE    0x000000FFU
#define GPIO_EXT_SD4_PRESCALE_M  (GPIOSD_SD4_PRESCALE_V << GPIOSD_SD4_PRESCALE_S)
#define GPIO_EXT_SD4_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD4_PRESCALE_S  8

/** GPIOSD_SIGMADELTA5_REG register
 *  Duty Cycle Configure Register of SDM5
 */
#define GPIO_EXT_SIGMADELTA5_REG (DR_REG_GPIOSD_BASE + 0x14)
/** GPIOSD_SD5_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD5_IN    0x000000FFU
#define GPIO_EXT_SD5_IN_M  (GPIOSD_SD5_IN_V << GPIOSD_SD5_IN_S)
#define GPIO_EXT_SD5_IN_V  0x000000FFU
#define GPIO_EXT_SD5_IN_S  0
/** GPIOSD_SD5_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD5_PRESCALE    0x000000FFU
#define GPIO_EXT_SD5_PRESCALE_M  (GPIOSD_SD5_PRESCALE_V << GPIOSD_SD5_PRESCALE_S)
#define GPIO_EXT_SD5_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD5_PRESCALE_S  8

/** GPIOSD_SIGMADELTA6_REG register
 *  Duty Cycle Configure Register of SDM6
 */
#define GPIO_EXT_SIGMADELTA6_REG (DR_REG_GPIOSD_BASE + 0x18)
/** GPIOSD_SD6_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD6_IN    0x000000FFU
#define GPIO_EXT_SD6_IN_M  (GPIOSD_SD6_IN_V << GPIOSD_SD6_IN_S)
#define GPIO_EXT_SD6_IN_V  0x000000FFU
#define GPIO_EXT_SD6_IN_S  0
/** GPIOSD_SD6_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD6_PRESCALE    0x000000FFU
#define GPIO_EXT_SD6_PRESCALE_M  (GPIOSD_SD6_PRESCALE_V << GPIOSD_SD6_PRESCALE_S)
#define GPIO_EXT_SD6_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD6_PRESCALE_S  8

/** GPIOSD_SIGMADELTA7_REG register
 *  Duty Cycle Configure Register of SDM7
 */
#define GPIO_EXT_SIGMADELTA7_REG (DR_REG_GPIOSD_BASE + 0x1c)
/** GPIOSD_SD7_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIO_EXT_SD7_IN    0x000000FFU
#define GPIO_EXT_SD7_IN_M  (GPIOSD_SD7_IN_V << GPIOSD_SD7_IN_S)
#define GPIO_EXT_SD7_IN_V  0x000000FFU
#define GPIO_EXT_SD7_IN_S  0
/** GPIOSD_SD7_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIO_EXT_SD7_PRESCALE    0x000000FFU
#define GPIO_EXT_SD7_PRESCALE_M  (GPIOSD_SD7_PRESCALE_V << GPIOSD_SD7_PRESCALE_S)
#define GPIO_EXT_SD7_PRESCALE_V  0x000000FFU
#define GPIO_EXT_SD7_PRESCALE_S  8

/** GPIOSD_SIGMADELTA_MISC_REG register
 *  MISC Register
 */
#define GPIO_EXT_SIGMADELTA_MISC_REG (DR_REG_GPIOSD_BASE + 0x24)
/** GPIOSD_FUNCTION_CLK_EN : R/W; bitpos: [30]; default: 0;
 *  Clock enable bit of sigma delta modulation.
 */
#define GPIO_EXT_FUNCTION_CLK_EN    (BIT(30))
#define GPIO_EXT_FUNCTION_CLK_EN_M  (GPIOSD_FUNCTION_CLK_EN_V << GPIOSD_FUNCTION_CLK_EN_S)
#define GPIO_EXT_FUNCTION_CLK_EN_V  0x00000001U
#define GPIO_EXT_FUNCTION_CLK_EN_S  30
/** GPIOSD_SPI_SWAP : R/W; bitpos: [31]; default: 0;
 *  Reserved.
 */
#define GPIO_EXT_SPI_SWAP    (BIT(31))
#define GPIO_EXT_SPI_SWAP_M  (GPIOSD_SPI_SWAP_V << GPIOSD_SPI_SWAP_S)
#define GPIO_EXT_SPI_SWAP_V  0x00000001U
#define GPIO_EXT_SPI_SWAP_S  31

